#Область ПрограммныйИнтерфейс
Процедура ЗаписатьДанные(ДокументСсылка) Экспорт 
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПланыКомандировок") Тогда 
		ЗаписатьДанныеПоПлану(ДокументСсылка);
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаявкаНаКомандировку") Тогда
		ЗаписатьДанныеПоЗаявке(ДокументСсылка);
	КонецЕсли;
	
КонецПроцедуры	
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьДанныеПоПлану(ДокументСсылка)  
	  План = Документы.ПланыКомандировок.ДанныеПлана(ДокументСсылка);  
	  Набор = РегистрыСведений.СогласованиеКомандировок.СоздатьНаборЗаписей();
	  Набор.Загрузить(План);
	  Набор.Записать();
КонецПроцедуры

Процедура ЗаписатьДанныеПоЗаявке(ДокументСсылка)
	
 Набор = РегистрыСведений.СогласованиеКомандировок.СоздатьНаборЗаписей();
 Набор.Отбор.Организация.Установить(ДокументСсылка.Организация);
 Набор.Отбор.Сотрудник.Установить(ДокументСсылка.Сотрудник);
 Набор.Отбор.Контрагент.Установить(ДокументСсылка.Контрагент);
 Набор.Отбор.ДатаНачала.Установить(ДокументСсылка.ДатаНачала);
 Набор.Отбор.ДатаОкончания.Установить(ДокументСсылка.ДатаОкончания);
 Набор.Отбор.Цель.Установить(ДокументСсылка.Цель);   
 Набор.Прочитать();  
 
 Если Набор.Количество() Тогда
	 Запись = Набор.Получить(0); 
	 Запись.Статус = ДокументСсылка.Статус;
 КонецЕсли;
 
 Набор.Записать();
 
КонецПроцедуры


#КонецОбласти
