&НаКлиенте
Перем Компонента;  

&НаКлиенте
Процедура ПроверитьПодкючение(Команда)
	
	// Вставить содержимое обработчика.
	Если Не ОбщийМодульRMQ.ИнициализироватьКомпонентуКлиентСервер(Компонента) Тогда
		ОбщийМодульRMQ.ПодключитьКомпонентуСервер(); 
		ОбщийМодульRMQ.ИнициализироватьКомпонентуКлиентСервер(Компонента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеТочкиИОчередь(Команда)
	
	Если Компонента <> "" Тогда
		ОбщийМодульRMQ.СозданиеТочкиИОчередиКлиентСервер(Компонента,Объект.Ссылка);
	КонецЕсли; 
	
КонецПроцедуры

Компонента = "";