
&НаСервере
Процедура ОтправитьВСистемуБронированияНаСервере() 
	
	РегистрыСведений.ОчередьИсходящихСообщений.ДобавитьСообщение(Объект.Ссылка);  
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВСистемуБронирования(Команда)
	ОтправитьВСистемуБронированияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	  УстановитьВидимостьОтправкиБронирования();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьВидимостьОтправкиБронирования();
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьОтправкиБронирования() 
	
	Если Объект.Статус = Перечисления.СтатусыЗаявокНаКомандировку.СогласованаОтделомКадров Тогда
		Элементы.ФормаОтправитьВСистемуБронирования.Видимость = Истина; 
	Иначе
		Элементы.ФормаОтправитьВСистемуБронирования.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры	
	
#КонецОбласти