#Область ПрограммныйИнтерфейс 

Процедура ДобавитьСообщение(ОтветноеСообщение) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьВходящихСообщений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Новый УникальныйИдентификатор();
	МенеджерЗаписи.Статус = Перечисления.СтатусСообщения.Новое; 
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.Хранилище = ОтветноеСообщение; 
	МенеджерЗаписи.Записать();
	
КонецПроцедуры	

Процедура УстановитьСтатусОбработан(Идентификатор) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьВходящихСообщений.СоздатьНаборЗаписей();
	МенеджерЗаписи.Отбор.Идентификатор.Установить(Идентификатор);
	МенеджерЗаписи.Прочитать();  
	
	Если МенеджерЗаписи.Количество() Тогда
		Запись = МенеджерЗаписи.Получить(0);	
		Запись.Статус = Перечисления.СтатусСообщения.Обработано; 
		МенеджерЗаписи.Записать(); 
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОбработатьВходящиеСообщения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьВходящихСообщений.Идентификатор КАК Идентификатор,
		|	ОчередьВходящихСообщений.Хранилище КАК Хранилище
		|ИЗ
		|	РегистрСведений.ОчередьВходящихСообщений КАК ОчередьВходящихСообщений
		|ГДЕ
		|	ОчередьВходящихСообщений.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусСообщения.Новое);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбработатьСообщение(ВыборкаДетальныеЗаписи.Хранилище); 
		УстановитьСтатусОбработан(ВыборкаДетальныеЗаписи.Идентификатор);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСообщение(ТекстСообщения)
	
	ЧтениеJSON = Новый ЧтениеJSON;  
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);  
	Объект = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаявкаНаКомандировку") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бронирование.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Бронирование КАК Бронирование
		|ГДЕ
		|	Бронирование.ЗаявкаНаБронирование = &ЗаявкаНаБронирование";
		
		Запрос.УстановитьПараметр("ЗаявкаНаБронирование", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Брнирование = Документы.Бронирование.СоздатьДокумент();
			Брнирование.Дата = ТекущаяДатаСеанса();
			Брнирование.СтатусБронирование =  Перечисления.СтаусБронирования.БронированиеНовое; 
			Брнирование.ЗаявкаНаБронирование = Объект.Ссылка;
			Брнирование.Записать();
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.Бронирование") Тогда
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаКомандировку.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаКомандировку КАК ЗаявкаНаКомандировку
		|ГДЕ
		|	ЗаявкаНаКомандировку.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЗаявкаНаБронирование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Заявка = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Заявка.СтаусБронирования = Объект.СтатусБронирование;
		Заявка.Записать();
	КонецЦикла;
	
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти 

