#Область ПрограммныйИнтерфейс

Функция ДанныеПлана(ДокументСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыКомандировокПлан.Сотрудник КАК Сотрудник,
		|	ПланыКомандировокПлан.Контрагент КАК Контрагент,
		|	ПланыКомандировокПлан.Цель КАК Цель,
		|	ПланыКомандировокПлан.ДатаНачала КАК ДатаНачала,
		|	ПланыКомандировокПлан.ДатаОкончания КАК ДатаОкончания,
		|	ПланыКомандировок.Организация КАК Организация,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаКомандировку.Новая) КАК Статус
		|ИЗ
		|	Документ.ПланыКомандировок.План КАК ПланыКомандировокПлан
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланыКомандировок КАК ПланыКомандировок
		|		ПО ПланыКомандировокПлан.Ссылка = ПланыКомандировок.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПланыКомандировок.Организация,
		|	ПланыКомандировокПлан.Сотрудник,
		|	ПланыКомандировокПлан.ДатаОкончания,
		|	ПланыКомандировокПлан.ДатаНачала,
		|	ПланыКомандировокПлан.Контрагент,
		|	ПланыКомандировокПлан.Цель";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции
	
#КонецОбласти