
Процедура ИсполняемыеСценарии() Экспорт
    
    ЮТТесты.ДобавитьТестовыйНабор("Документ Планы командировок: Проверка проведения").ВТранзакции()
		.ДобавитьТест("ПроверкаПроведенияПозитив", "Планирование командировок", "Позитив, TASK-1, Клишев Евгений")
		.ДобавитьТест("ПроверкаПроведенияНегатив", "Планирование командировок некорректные даты", "Негатив, TASK-1, Клишев Евгений")
		;

КонецПроцедуры

Процедура ПроверкаПроведенияПозитив() Экспорт
	
	// Описание программного создания: https://bia-technologies.github.io/yaxunit/docs/features/test-data/data-generation/
	
	// Создание тестовых данных
	СотрудникНовый = СозданиеСотрудника("Test_Сотрудник");
	КонтрагентНовый = СозданиеКонтрагента("Test_Контрагент");
	ОрганизацияНовый = СозданиеОрганизации("Test_Организация");

	// Создание плана
	Цель = "Цель комадировки";
	ПланируемыйРезультат = "Планируемый результат";
	Адрес = "Адрес местаназначения командировки"; 
	ДатаНачала = Дата('20250911');
	ДатаОкончания = Дата('20250915');
	Бюджет = 30000;
	
	ПланКомандировок = ЮТест.Данные().КонструкторОбъекта("Документы.ПланыКомандировок")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Организация", ОрганизацияНовый)
		.ТабличнаяЧасть("План").ДобавитьСтроку()
			.Установить("Сотрудник", СотрудникНовый)
			.Установить("Контрагент", КонтрагентНовый) 
			.Установить("Цель", Цель)
			.Установить("ПланируемыйРезультат", ПланируемыйРезультат)
			.Установить("Адрес", Адрес)
			.Установить("ДатаНачала", ДатаНачала)
			.Установить("ДатаОкончания", ДатаОкончания)
			.Установить("Бюджет", Бюджет)
		.Записать() // формируем документ ссылку не проведенную
		;
		
	// Проверка метода проведения, в случае выполнения: РасходТовара.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение)
	// Описание проверки метода: https://bia-technologies.github.io/yaxunit/docs/features/assertions/assertions-base#%D0%BF%D1%80%D0%BE%D0%B2%D0%B5%D1%80%D0%BA%D0%B0-%D0%B2%D1%8B%D0%BF%D0%BE%D0%BB%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F-%D0%BC%D0%B5%D1%82%D0%BE%D0%B4%D0%B0
	
	
	ЮТест.ОжидаетЧто(ПланКомандировок.ПолучитьОбъект())  // Объект, метод которого проверяем
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)   // Указываем проверяемый метод и параметры вызова
		.НеВыбрасываетИсключение()	
		;

КонецПроцедуры

Процедура ПроверкаПроведенияНегатив() Экспорт
	
	// Описание программного создания: https://bia-technologies.github.io/yaxunit/docs/features/test-data/data-generation/
	//
	//// Создание товара
	СотрудникНовый = СозданиеСотрудника("Test_Сотрудник");
	КонтрагентНовый = СозданиеКонтрагента("Test_Контрагент");
		ОрганизацияНовый = СозданиеОрганизации("Test_Организация");

	// Создание плана
	Цель = "Цель комадировки";
	ПланируемыйРезультат = "Планируемый результат";
	Адрес = "Адрес местаназначения командировки"; 
	ДатаНачала = Дата('20250911');
	ДатаОкончания = Дата('20250815');
	Бюджет = 30000;
	
	ПланКомандировок = ЮТест.Данные().КонструкторОбъекта("Документы.ПланыКомандировок")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Организация", ОрганизацияНовый)
		.ТабличнаяЧасть("План").ДобавитьСтроку()
			.Установить("Сотрудник", СотрудникНовый)
			.Установить("Контрагент", КонтрагентНовый) 
			.Установить("Цель", Цель)
			.Установить("ПланируемыйРезультат", ПланируемыйРезультат)
			.Установить("Адрес", Адрес)
			.Установить("ДатаНачала", ДатаНачала)
			.Установить("ДатаОкончания", ДатаОкончания)
			.Установить("Бюджет", Бюджет)
		.Записать() // формируем документ ссылку не проведенную
		;
	
	// Проверка метода проведения, в случае выполнения кода: 
	//РасходТовара.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	// Описание проверки метода: https://bia-technologies.github.io/yaxunit/docs/features/assertions/assertions-base#%D0%BF%D1%80%D0%BE%D0%B2%D0%B5%D1%80%D0%BA%D0%B0-%D0%B2%D1%8B%D0%BF%D0%BE%D0%BB%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F-%D0%BC%D0%B5%D1%82%D0%BE%D0%B4%D0%B0
	
	//
	ЮТест.ОжидаетЧто(ПланКомандировок.ПолучитьОбъект())  // Объект, метод которого проверяем
		.Метод("Записать",  ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный)) // Указываем проверяемый метод и параметры вызова
		.ВыбрасываетИсключение("Не удалось провести ""Планы командировок")	
		;
		
	Сообщения = ПолучитьСообщенияПользователю();
	ЮТест.ОжидаетЧто(Сообщения)
		.ИмеетТип("ФиксированныйМассив")
		.ИмеетДлину(1)
		.Свойство("[0].Текст")
			.ИмеетТип("Строка")
			.Содержит("Некорректно заполнены даты командировок в плане")
	//	;

КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Функция СозданиеСотрудника(Наименование)
	
	// Создание товара с видом Товар
	//ТоварНовый = ЮТест.Данные().СоздатьЭлемент("Справочники.Товары");   - не подойдет, т.к. не можем отрегулировать вид товара
		
	КонструкторСотрудника = ЮТест.Данные().КонструкторОбъекта("Справочники.ФизическиеЛица")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", Наименование)
		;
	СотрудникНовый = КонструкторСотрудника.Записать();
	
	Возврат СотрудникНовый;

КонецФункции

Функция СозданиеКонтрагента(Наименование)
	
	// Создание товара с видом Товар
	//ТоварНовый = ЮТест.Данные().СоздатьЭлемент("Справочники.Товары");   - не подойдет, т.к. не можем отрегулировать вид товара
		
	КонструкторКонтрагента = ЮТест.Данные().КонструкторОбъекта("Справочники.Контрагенты")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", Наименование)
		;
    КонтрагентНовый = КонструкторКонтрагента.Записать();
	
	Возврат КонтрагентНовый;

КонецФункции

Функция СозданиеОрганизации(Наименование)
	
	// Создание товара с видом Товар
	//ТоварНовый = ЮТест.Данные().СоздатьЭлемент("Справочники.Товары");   - не подойдет, т.к. не можем отрегулировать вид товара
		
	КонструкторОрганизации = ЮТест.Данные().КонструкторОбъекта("Справочники.Организации")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", Наименование)
		;
    ОрганизацияНовый = КонструкторОрганизации.Записать();
	
	Возврат ОрганизацияНовый;

КонецФункции

#КонецОбласти