#Область ПодключениеИнициализацияКомпоненты

Процедура ПодключитьКомпонентуСервер(КомпонентаПодключена = Неопределено) Экспорт
	
	АдресВоВременномХранилище = ПолучитьАдресМакетаКомпановкиНаСервере(Новый УникальныйИдентификатор());
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			АдресВоВременномХранилище,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
	Сообщить(НСтр("ru = 'Компонента подключена!'")); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

Функция ПолучитьАдресМакетаКомпановкиНаСервере(УникальныйИдентификатор)
	
	МакетВнешнейКомпоненты    = ОбщийМодульRMQВызовСервера.ПолучитьОбщийМакетRMQ();
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетВнешнейКомпоненты, УникальныйИдентификатор);
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции

Функция ИнициализироватьКомпонентуКлиентСервер(Компонента = "") Экспорт
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Сообщить(НСтр("ru = 'Подключение успешно выполнено!'"));
		Возврат Истина;  
	Исключение
		Сообщить(НСтр("ru = 'Подключение не выполнено!'"));
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыРаботаСRabbitMQ

Процедура ПроверитьПодключениеКлиентСервер(КлиентКомпоненты, ПараметрыПодключения) Экспорт
	
	Парам = ОбщийМодульRMQВызовСервера.ПараметрыПодключения(ПараметрыПодключения);
	
	Попытка
		КлиентКомпоненты.Connect(
				Парам.Адрес,
				Парам.Порт,
				Парам.Логин,
				Парам.Пароль,
				Парам.ВиртуальныйХост);
			Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка подключения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Сообщить(НСтр("ru = 'Подключение успешно выполнено!'"));
	
КонецПроцедуры

Процедура СозданиеТочкиИОчередиКлиентСервер(КлиентКомпоненты, ПараметрыПодключения) Экспорт
	
	Парам = ОбщийМодульRMQВызовСервера.ПараметрыПодключения(ПараметрыПодключения);
	
	Попытка
		КлиентКомпоненты.Connect(
			Парам.Адрес,
			Парам.Порт,
			Парам.Логин,
			Парам.Пароль,
			Парам.ВиртуальныйХост);
			
		ТочкаОбмена = Парам.ТочкаОбмена;
		ИмяОчереди  = Парам.ИмяОчереди;
		
		КлиентКомпоненты.DeclareExchange(ТочкаОбмена, "topic", Ложь, Истина, Ложь);
		КлиентКомпоненты.DeclareQueue(ИмяОчереди, Ложь, Ложь, Ложь, Ложь);
		КлиентКомпоненты.BindQueue(ИмяОчереди, ТочкаОбмена, "#" + ИмяОчереди + "#");
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка создания точек и очередей!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Сообщить("Точки и очереди успешно созданы!");
КонецПроцедуры

Процедура ОтправитьСообщениеКлиентСервер(ТекстСообщения) Экспорт
	
	КлиентКомпоненты = "";
	
	ПодключитьКомпонентуСервер(КлиентКомпоненты);
	ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты);
	
	Парам = ОбщийМодульRMQВызовСервера.ПараметрыПодключения("RMQ");
		
	Попытка
		КлиентКомпоненты.Connect(
			Парам.Адрес,
			Парам.Порт,
			Парам.Логин,
			Парам.Пароль,
			Парам.ВиртуальныйХост);
		
		ТочкаОбмена    = Парам.ТочкаОбмена;
		ИмяОчереди     = Парам.ИмяОчереди;
		
		КлиентКомпоненты.BasicPublish(
			ТочкаОбмена,
			"#" + ИмяОчереди + "#",
			ТекстСообщения,
			1,
			Ложь);
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Сообщить("Сообщение успешно отправлено!");
КонецПроцедуры

Процедура ПрочитатьСообщениеКлиентСервер() Экспорт
	
	КлиентКомпоненты = "";
	
	ПодключитьКомпонентуСервер(КлиентКомпоненты);
	ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты);
	
	Парам = ОбщийМодульRMQВызовСервера.ПараметрыПодключения("RMQ");

	Попытка
		КлиентКомпоненты.Connect(
			Парам.Адрес,
			Парам.Порт,
			Парам.Логин,
			Парам.Пароль,
			Парам.ВиртуальныйХост);
		
		ИмяОчереди = Парам.ИмяОчереди;
		
		Попытка
			КлиентКомпоненты.DeclareQueue(ИмяОчереди, Ложь, Ложь, Ложь, Ложь);
			
			Потребитель = КлиентКомпоненты.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			
			ОтветноеСообщение = "";
			Если КлиентКомпоненты.BasicConsumeMessage("", ОтветноеСообщение, 5) Тогда
				КлиентКомпоненты.BasicAck(); 
				ОбщийМодульRMQВызовСервера.ДобавитьВходящееСообщение(ОтветноеСообщение);
				ТекстСообщения = НСтр("ru='Сообщение успешно прочитано!'");
			Иначе
				//Парам.ОтветноеСообщение = ОтветноеСообщение;
				ТекстСообщения = НСтр("ru='Очередь пустая!'");
			КонецЕсли;
			Сообщить(ТекстСообщения);
			
			КлиентКомпоненты.BasicCancel("");
		Исключение
			ВызватьИсключение КлиентКомпоненты.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
