#Область СлужебныеПроцедуры

Функция ПолучитьОбщийМакетRMQ() Экспорт
	
	МакетВнешнейКомпоненты = ПолучитьОбщийМакет("ВнешняяКомпонентаRMQ");
		
	Возврат МакетВнешнейКомпоненты;
	
КонецФункции 

Функция ПараметрыПодключения(НастройкиПодключенияRMQ) Экспорт
	
	Если ТипЗнч(НастройкиПодключенияRMQ) = Тип("Строка") Тогда
		НастройкиПодключенияRMQ = Справочники.НастройкиПодключенияRMQ.НайтиПоНаименованию(НастройкиПодключенияRMQ); 
	КонецЕсли;
	
	Параметры =  Новый Структура;
	
	Параметры.Вставить("Адрес",НастройкиПодключенияRMQ.Адрес);
	Параметры.Вставить("Порт", НастройкиПодключенияRMQ.Порт);
	Параметры.Вставить("Логин", НастройкиПодключенияRMQ.Логин);
	Параметры.Вставить("Пароль", НастройкиПодключенияRMQ.Пароль);
	Параметры.Вставить("ВиртуальныйХост", НастройкиПодключенияRMQ.ВиртуальныйХост);
	Параметры.Вставить("ИмяОчереди", НастройкиПодключенияRMQ.ИмяОчереди);
	Параметры.Вставить("ТочкаОбмена", НастройкиПодключенияRMQ.ТочкаОбмена);
	
	Возврат Параметры;
	
КонецФункции

Процедура ДобавитьВходящееСообщение(ОтветноеСообщение) Экспорт
	
	РегистрыСведений.ОчередьВходящихСообщений.ДобавитьСообщение(ОтветноеСообщение);
	
КонецПроцедуры	
#КонецОбласти

 