
&НаСервере
Процедура ОтправитьСотрудникамНаСервере()
	
	Для каждого СтрПлана Из Объект.План Цикл
		
		Если НЕ Документы.ЗаявкаНаКомандировку.ЕстьЗаявкаНаКомандировку(СтрПлана, Объект.Организация) Тогда
			Заявка = Документы.ЗаявкаНаКомандировку.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(Заявка, Объект.Ссылка);
			ЗаполнитьЗначенияСвойств(Заявка, СтрПлана);
			Заявка.Основание = Объект.Ссылка;
			Заявка.Статус = Перечисления.СтатусыЗаявокНаКомандировку.Новая;
			Заявка.УстановитьНовыйНомер("К");
			Заявка.Записать();  
		Иначе
			Сообщить(СтрШаблон("Для сотрудника %1, контрагента %2, на период с %3 по %4 командировка заведена!",СтрПлана.Сотрудник, СтрПлана.Контрагент, СтрПлана.ДатаНачала, СтрПлана.ДатаОкончания));
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСотрудникам(Команда) 
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОтправитьСотрудникамНаСервере(); 
	Иначе
		Сообщить("Документ еще не записан");
	КонецЕсли;
КонецПроцедуры
