#Область ПрограммныйИнтерфейс

Процедура ОбработатьОчередьИсходящихСообщений() Экспорт 
	
	ВыборкаДетальныеЗаписи = РегистрыСведений.ОчередьИсходящихСообщений.ВыборкаНовыхСообщений();
	 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ОбщийМодульRMQ.ОтправитьСообщениеКлиентСервер(ВыборкаДетальныеЗаписи.Хранилище);
		РегистрыСведений.ОчередьИсходящихСообщений.УстановитьСтатусОбработан(ВыборкаДетальныеЗаписи.Идентификатор);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОчередьВходящихСообщений() Экспорт
	
	 ОбщийМодульRMQ.ПрочитатьСообщениеКлиентСервер();
	 
КонецПроцедуры

Процедура ОбработатьОчередьВходящихСообщений() Экспорт
	
	РегистрыСведений.ОчередьВходящихСообщений.ОбработатьВходящиеСообщения();
	 
КонецПроцедуры

#КонецОбласти