#Область ПрограммныйИнтерфейс 

Процедура ДобавитьСообщение(СсылкаОбъекта) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьИсходящихСообщений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Новый УникальныйИдентификатор();
	МенеджерЗаписи.Статус = Перечисления.СтатусСообщения.Новое; 
	МенеджерЗаписи.Дата = СсылкаОбъекта.Дата;
	МенеджерЗаписи.Хранилище = СериализованныйОбъект(СсылкаОбъекта); 
	МенеджерЗаписи.Записать();
	
КонецПроцедуры	

Процедура УстановитьСтатусОбработан(Идентификатор) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьИсходящихСообщений.СоздатьНаборЗаписей();
	МенеджерЗаписи.Отбор.Идентификатор.Установить(Идентификатор);
	МенеджерЗаписи.Прочитать();  
	
	Если МенеджерЗаписи.Количество() Тогда
		Запись = МенеджерЗаписи.Получить(0);	
		Запись.Статус = Перечисления.СтатусСообщения.Обработано; 
		МенеджерЗаписи.Записать(); 
	КонецЕсли;
	
КонецПроцедуры	

Функция ВыборкаНовыхСообщений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьИсходящихСообщений.Идентификатор КАК Идентификатор,
	|	ОчередьИсходящихСообщений.Хранилище КАК Хранилище
	|ИЗ
	|	РегистрСведений.ОчередьИсходящихСообщений КАК ОчередьИсходящихСообщений
	|ГДЕ
	|	ОчередьИсходящихСообщений.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусСообщения.Новое);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат  ВыборкаДетальныеЗаписи;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция СериализованныйОбъект(СсылкаОбъекта)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб); 
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON); 
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,СсылкаОбъекта.ПолучитьОбъект(),НазначениеТипаXML.Явное);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Возврат СтрокаJSON;
	
КонецФункции 

#КонецОбласти 

