#Область ПрограммныйИнтерфейс

Функция ЕстьЗаявкаНаКомандировку(План, Организация) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаКомандировку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаКомандировку КАК ЗаявкаНаКомандировку
	|ГДЕ
	|	ЗаявкаНаКомандировку.Организация = &Организация
	|	И ЗаявкаНаКомандировку.Сотрудник = &Сотрудник
	|	И ЗаявкаНаКомандировку.ДатаНачала = &ДатаНачала
	|	И ЗаявкаНаКомандировку.ДатаОкончания = &ДатаОкончания
	|	И ЗаявкаНаКомандировку.Контрагент = &Контрагент
	|	И ЗаявкаНаКомандировку.Цель = &Цель";
	
	Запрос.УстановитьПараметр("ДатаНачала", План.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", План.ДатаОкончания);
	Запрос.УстановитьПараметр("Контрагент", План.Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", План.Сотрудник);
	Запрос.УстановитьПараметр("Цель", План.Цель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() Тогда
		Результат = Истина;
	Иначе
		Результат = ложь;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти